app/Controllers/Users.php

    public function index()
    {

        $userModel = new UsersModel();
        $query = $userModel->findAll();
---
SELECT *
FROM `ci_users`